{ "posts": [{
    "title": "Healing the Masculine – As a Woman",
    "author": "Mommy Mystic",
    "image": "https://mommymystic.files.wordpress.com/2017/06/manundertreesunset.jpg",
    "teaser": "This blog is dedicated to healing and empowering the feminine, as is my private session work, but of course feminine energy and power does not exist in isolation. The feminine and masculine are codependent, defining each other. Whether we are talking about our physical bodies...",
    "fulltext": "This blog is dedicated to healing and empowering the feminine, as is my private session work, but of course feminine energy and power does not exist in isolation. The feminine and masculine are codependent, defining each other. Whether we are talking about our physical bodies, our subtle bodies, psychological traits, abstract energies apart from gender, or any of the other many things we label ‘feminine’ and ‘masculine’, we cannot ever really work with just one and not the other. Historically the feminine and masculine have been wounded and dysfunctional together, and they now must heal and come forth into the light together.\nFor some, talking in terms of the feminine and masculine in any context seems antiquated. Certainly within the context of transgender rights, these categorizations seem rigid and harmful. It’s clear that on the level of the human body and gender identification – and I would argue on the level of the subtle body too – masculine/feminine is a spectrum, not a duality. I look forward to the day when it no longer makes sense to talk about ’empowering the feminine’ or ‘healing the masculine.’ When there is a fluidity and wholeness in all of us that allows us to express ourselves in all manners however we see fit.\nBut that day is not now, and it’s important to talk about it. This has been brought home to me in a very real way recently as I watch my two younger children, girl-boy twins, enter ‘tweenhood’ and middle school. The differences in their gender-based conditioning, and the social expectations they each face, has never been more clear. In some ways, in a community like mine, there has been more change for girls than boys – girls in team sports is a given, and the girls are encouraged to play hard and tough on the field. A boy in ballet however, is still the exception.  And off the sports field, I find the emotional conditioning has not changed much – ‘be nice and get along’ for girls  vs. ‘be tough and be the best’ for boys might be the best way of summing it up.\nI’ve written before about how the pressure to ‘be nice’ impacts women and their ability to own their power, so I won’t belabor that again in this post. But what is the impact of the male conditioning to ‘be tough’? Emotional repression, and self-worth based on dominance and achievement, are still bred into our boys. As they move through their adolescence towards adulthood, true expression of their emotions – especially any seen as ‘weak’ – is less and less acceptable. Meanwhile, accolades for accomplishment – whether in sports, academics, or any other realm – is rewarded. Boys receive a very clear message about where their worth lies, and emotional awareness and expression is still low in value.\nBut the human psyche is sensitive, whether housed in a female or male body. So where does any hurt go if it’s not acknowledged and expressed? A lot of dysfunctional places. Men are twice as likely as women to become alcoholic. Twice as likely to die of an opioid addiction. Between 3 and 4 times more likely to commit suicide. 10 times as likely to be incarcerated. 80% of violent crimes are committed by men. 82% of all childhood sexual assault and 90% of all adult sexual assault is perpetrated by men.\nThis is what we are facing when we talk about healing the masculine.\nOf course the reality behind all of these statistics is much more complex than little boys being told to toughen up. There are biological, economic, social, religious, racial, and cultural factors contributing, and change needs to take place within every realm – just as it does for the empowerment of the feminine. And the sense of male entitlement instilled as part of our still predominantly patriarchal culture is as much a problem as internalized pain (although I would argue they are two sides of the same coin.)\nBut all change begins within ourselves, so as women, how do we start with ourselves on this? How do we begin to recognize our own part in perpetuating the conditioning at work? How do we surface and shift the dysfunctional masculine-feminine dichotomy as it is reflected in our own psyches and subtle bodies?\nPersonal Inquiry\nIt’s not an easy question, but as always, a good place to start is personal inquiry. Often just asking a question brings about a shift. So here’s some questions to  begin asking yourself:\nDo you on some level label the men in your life ‘weak’ and ‘strong’? If so, what criteria is this based on? Do you label certain men as passive or effeminate, and if so, what criteria does it reflect? Do you find emotional expression in a man, including crying, a turn off? What’s your reaction when learning a man is in a formerly traditional ‘feminine’ role, such as a stay-at-home dad, a nurse, or teacher? In a partner, do you value emotional stoicism or expression? Are you seeking a protector or savior and looking to find that in male family members, friends or partners?\nWhat beliefs have you internalized about how you can and cannot express yourself? How you can and cannot dress? What you can and cannot do? Did these differ for male siblings or family members? If you are a parent or work with children, which of these are you passing on? What expectations do you have for girls vs. boys? What messages do you send to each?\nWithin your own personal history, what has been your relationship to and treatment by the men in your lives – father, stepfather, grandfather, brothers, uncles, male teachers, male coaches, etc? How have they made you feel about yourself? Do you harbor shame or anger in relation to any of them, and have you dealt with it? (Of course if you have been the victim of domestic abuse, sexual abuse, or assault, this is an especially big healing process.) How has this impacted your own relationships with men in your life now?\nMoving inward, do an assessment between yin and yang, feminine and masculine, as expressed within your own personality and psyche. What traits do you consider to be feminine and which masculine? Within each category, which do you consider healthy and which dysfunctional expressions? Looking at it from this perspective, do you see any patterns of looking to the men in your life to fill emotional gaps rather than bringing those forth yourself (this is often related to looking to men as protectors, stabilizers, and saviors?)\nChakra Work\nOn the subtle body level, every chakra and energy channel mapping system defines certain centers and pathways as yin or feminine, and others as yang or masculine. Working with these energies and seeking to unite and integrate them provides another powerful way of working to heal the masculine. Within the context of the chakra work I share on this blog, the most straightforward mapping is to work with the following:\nThe first/root, third/navel, fifth/throat, and seventh/crown chakras are masculine in their default expression\nThe second/sacral, fourth/heart, and sixth/third-eye are feminine in their default expression\nAll of the chakras have both emanating/masculine and receptive/feminine aspects, so when we talk about them as masculine and feminine we are talking about a default expression. There are many gradations within this in terms of gender and individual subtle bodies, but I still find it a helpful model for working with in most people. Here are some of the ways you can begin to work with the chakras in this way:\nReview the energies and psychological functions associated with each chakra (you can use the various charts and mappings included in my Chakra Levels series, or many other posts on the Chakras page, as a reference.) When viewed from this perspective, do you see any patterns related to masculine and feminine chakras? Do you have more blocks in one grouping vs. the other? Or a hyper-reliance on the aspects of one or the other? If so, work with the exercises and the other methods outlined in the Chakra Levels series to address this imbalance.\nSpecifically in relation to your masculine chakras, what blocks do you perceive? Do you have trouble owning the open, powerful expressions of these chakras? If so, determine some ways to work with opening these pathways within yourself.\nPractice visually integrating the masculine and feminine chakra energies. This in and of itself can be a very powerful tool. Here is one simple exercise for doing so:\nHold a fist at your tailbone – focal point for your root chakra. This fist does not represent aggression, but instead a centered, consolidated energy. Imagine this centered, consolidated energy is mirrored within your root chakra beneath your fist as a ball of light (you can use traditional chakra colors for this, or just use white.)\nRepeat this at your other masculine chakras – your navel, throat, and crown.\nSit for a moment visualizing these 4 centered, consolidated balls of light within your subtle body.\nNow let go of this and using the index finger of one hand draw a figure 8 or infinity symbol an inch or so in front of your pelvis – focus point for your sacral chakra. Imagine this swirling, moving energy is mirrored within your pelvic bowl. Allow your body to sway and move if you like.\nRepeat this at your other feminine chakras – your heart and third eye.\nSit for a moment visualizing these 3 spiraling, flowing nexuses of energy within your subtle body.\nNow from the bottom up, move through each chakra and connect the centered, consolidated balls with the spiraling, flowing energy. Begin with your root and move up through your sacral, navel, heart, throat, third eye, and crown. See one energy as seamlessly flowing into the next in a pattern. Try to feel this within your body, in addition to visualizing it. Allow some variability in how this appears to you – allow some room for spontaneity.\nCycle through more than once if you like. Once you feel as if there is some sense of completion, dissolve the visuals and rest in a sense of wholeness and integration.\nThose of you who have completed my DailyOm course or Sexual Trauma healing teleseminar will recognize this as a simpler version of an exercise I do in those courses. Although simpler, it is no less powerful when fully felt, and is easily done on your own if you are familiar with the chakras.\nThe shifts going on in our world right now are nothing short of monumental, and so many of them can be viewed as part of the rebalancing between the masculine and feminine – a dismantling of patriarchy, healing of the masculine and empowerment of the feminine – within individuals, societies, and the energy matrix that composes our world. In many ways right now we are seeing a backlash against these shifts in our political landscape and commentary. It is very difficult not to meet these forces with oppositional anger, and of course this anger is more than justified. But to respond only in this way virtually guarantees the continuation of these age old ways of being. The question we are all facing now is how to engage differently? It isn’t easy for an individual or society to truly change its entire frame of reference. It is deep work, and something we all need to engage in. And working within the context of the masculine and feminine is an essential part of this work.\nTwo recommendations worth mentioning within this context:\nThe book South of Forgiveness: A True Story of Rape and Responsibility, by Elva Thordis and Tom Stranger, in which a rape survivor and her rapist struggle to come to terms with each other and the crime committed, looking at rape culture, patriarchy, and gender conditioning along the way. Although I have mixed feelings about this book, it raises questions in a way few other books have done, and for that reason, is worth reading for those interested and who feel able to handle the difficult emotional material and depiction of rape.\nThe online course Transcending Sexual Trauma Through Yoga Online Training, by Zabie Yamasaki. I have been a part of Zabie’s weekend in-person trauma sensitivity training for yoga instructors for several years, contributing a workshop on trauma sensitive meditation and chakra work. Zabie has now made this course available as an online offering, and included a self-healing module sexual trauma survivors may work through on their own.\nMay both the feminine and masculine within you be healed, empowered, and integrated\nMay this radiate out into the world, becoming part of the shifts occurring there\nMay we all know ourselves as whole, happy, and healthy"
  }, {
    "title": "Understanding Your Feminine Energy Body",
    "author": "Mommy Mystic",
    "image": "https://mommymystic.files.wordpress.com/2012/05/healingsubtlebodyfromsexualtrauma1.jpg",
    "teaser": "Do you feel you absorb the moods and energies of people around you? Do you find yourself mirroring other people’s emotions or opinions back to them, often without realizing it until you are out of a situation? Do you sense that you energetically anchor your family and friends, and does that sometimes become overwhelming?...",
    "fulltext": "Do you feel you absorb the moods and energies of people around you? Do you find yourself mirroring other people’s emotions or opinions back to them, often without realizing it until you are out of a situation? Do you sense that you energetically anchor your family and friends, and does that sometimes become overwhelming?\nThese are all common experiences for many women. Our social conditioning encourages us to structure our identities around our relationships, and our role in others’ lives. But there is more at work in these experiences than simple emotional sensitivity. There are also energetic principles at work – qualities of our feminine energy bodies that impact how we experience and interact in all aspects of our lives.\nWhat do I mean by ‘energy body’? I think of our energy body as the intermediary between our physical body and our spirit. We both receive and transmit energetic ‘data’ through our energy body. Others’ emotions and thoughts, vibrations from our physical surroundings, and messages or insights from spiritual levels of being, pass through our energy body into our physical self. Our own moods, thoughts, physical and spiritual vibrations are transmitted outward, also through our energy body. Our energy body is our energetic antenna.\nJust as we have a physical anatomy, so we also have an energetic, or subtle, anatomy. Many cultures around the world have developed energy body mappings, some as part of energy healing traditions, and others as part of spiritual traditions. The most common health-based mapping is the meridian system – the basis for acupuncture, and several other alternative healing modalities. The most common spiritually-derived mappings are chakra systems, used in yoga and meditation traditions as gateways to spiritual growth and experience.\nWhat is most helpful for women to understand is that our energy bodies differ from men’s – just as our physical bodies differ. In fact, many of our energy body differences mirror the physical differences; and just as the physical differences – particularly in our hormonal levels and patterns  – influence every aspect of our health, so our energetic differences influence many areas of our lives.\nThe three main characteristics of women’s energy bodies are:\n1) Women’s energy bodies are centripetal. Although everyone’s energy bodies both attract and emanate energy, women’s in general are more absorbent, and receptive, pulling energy in from around them. This energy may be in the form of other’s emotions and thoughts, in the form of vibrations from physical surroundings, or in the form of etheric and spiritual input. Depending on how we learn to handle this influx of energetic ‘data’, we might be exceptionally intuitive, suggestible, or just overwhelmed (many of us swing between these!)\n2) Women’s energy bodies run in cycles and phases. Just as our physical bodies experience a hormonal cycle every month in our pre-menopausal years, so our energy body also flows in cycles. Our energy bodies are more centripetal, more absorbent of energy from the outside, in the days leading up to menstruation. We are more creatively oriented – expressing outwards both energetically and personally – closer to ovulation. Peri-menopause is often a time of extreme energetic swings between these two phases, as our cycle becomes less regular. Although often challenging, peri-menopause offers an opportunity for us to be reborn as wise women, with full access to both our intuitive and creative aspects.\n3) Women’s energy bodies offer a unique spiritual gateway. Just as our womb is the doorway for new physical life, so the corresponding energy center – our second or sacral chakra – is a unique spiritual gateway, into Source itself. While the traditional model for spiritual enlightenment is often one based on solitary prayer and meditation, leading to a metaphysical union with Source/God, feminine spiritual traditions of all faiths have put forth an alternative, uniquely feminine path. This path is based on embodiment, and integration with all aspects of life, rooted in our connection to creation, nature, and relationship.\nThese energetic differences have far-ranging implications for our lives, and for our spiritual journeys, all of which I hope to explore in more detail in this column going forward. In the meantime, here is a simple meditation you can experiment with, to help you begin to connect with your feminine energy body. It is a meditation on the three ‘yin’, or receptive/feminine chakras, the 2nd (womb), 4th (heart), and 6th (third eye) centers:\n–\tSit quietly and center yourself with a few deep breaths.\n–\tPlace your hands gently on your pelvic area, 4-5 inches below your navel. Take a few deep breaths into your hands, imagining the air filling your pelvic area. If you like, close your eyes and visualize a beautiful light encompassing this area of your body.\n–\tNow move your hands up to the center of your chest, right where your breastbone begins to curve. Take a few deep breaths into your chest cavity, filling it with air. Close your eyes and visualize light filling your chest.\n–\tMove your hands to your forehead, pressing one finger a little above the midpoint of your eyebrows. Breathe into this area, and visualize a radiant light filling the entire frontal lobe of your brain.\n–\tRepeat as many times as you like. Finish by re-centering yourself and gently opening your eyes.\nYou can combine this with any other meditation or devotional practice you may have.  Over time, it will help you become aware of your feminine energy centers, and your overall feminine energy body. In future columns I will talk about ways to protect your energy body, clear it, work with the intuitive data that flows into you through it, and access the spiritual, creative doorway available to you."
  }, {
    "title": "The Stages of Kundalini Shifts – Growing Into the New You",
    "author": "Mommy Mystic",
    "image": "https://mommymystic.files.wordpress.com/2014/01/2nd.jpg",
    "teaser": "“Deep in their roots, all flowers keep the light.” – Theodore Roethke\nAs I mentioned in the first article in this Kundalini Series, the image most often used in yogic teachings to explain kundalini is that of a coiled snake resting at the base of our spine, waiting to awaken. But I actually prefer the image of a seed sprouting deep in the ground...",
    "fulltext": "“Deep in their roots, all flowers keep the light.” – Theodore Roethke\nAs I mentioned in the first article in this Kundalini Series, the image most often used in yogic teachings to explain kundalini is that of a coiled snake resting at the base of our spine, waiting to awaken. But I actually prefer the image of a seed sprouting deep in the ground, and pushing upwards towards the sun. Like a seed, each of us is pure potential, and it is our innate spiritual yearning that compels us to crack our shell, push through barriers, and reach for the light. This is the journey of the kundalini rising.\nOur kundalini rises because of our own spiritual yearning. The part of us that wishes to know ourselves fully as Source or Light (or whatever word you wish to use) calls our kundalini to action. Whether this comes about because of formal spiritual practices we do, a teacher transmission (‘shaktipat’), or is spontaneously triggered by a significant life event or crises, the result is the same – the kundalini pushes through blocks stored in the energetic and etheric levels of our being.\nThink of a river when it becomes flooded, and the water rushes through previously impassable spots, pushing up tree roots, moving rocks, and rearranging the landscape. This is what happens in your subtle body when you undergo a kundalini shift. It might be a little flood, barely felt by you, or it might be a big one, transforming your entire world. Because our subtle body represents the intersection of mind, body, and spirit, you might experience the results of this reshaping on any of these levels.\nAlthough the process unfolds differently for each of us, there are several main stages of kundalini shifts. Depending on the intensity of a particular shift, you may experience these over the course of days, weeks, or even years. If you experience multiple shifts in a lifetime, you may in fact have one shift you are working through over the course of your entire life, while cycling through other, smaller shifts throughout that time as well. The possibilities are as individual as the number of beings there are in the universe. The purpose of the guide below is to provide some kind of map and advice that might help you process, and ultimately integrate, your own kundalini shifts.\nStage 1 – Bliss and Bursts\nOne of the main byproducts of kundalini shifts is bliss – feelings of liquid light moving through your being in gentle, but powerful, waves. This might happen within a meditation session, or spontaneously throughout your day. It’s a beautiful and at times ecstatic experience, but it’s not really the point. Enjoy the wonderful feelings when they arise, but don’t get attached or strive to recreate them once they have run their course, or you’ll get stuck. They are a means to an end, not the end itself.\nAnother way that kundalini shifts might initially manifest is as physical energy bursts. You might feel very restless, as if you need to shake or sway, or experience spontaneous movements (‘kriyas.’) This is your physical body’s way of processing the new level of energy moving through your subtle body. As I mentioned in last month’s article, a kundalini shift is like a wattage upgrade, and your physical body is the circuit board or outlet – it has to learn to handle the new flow. The best thing you can do during this time is attend to your physical health, exercise, and stay grounded. (Along these lines, notice how the sunflower seed in the picture above first develops roots, before growing upward – this is absolutely the best advice for handling a kundalini shift.)\nStage 2 – Growth Spurt\nLike a kid after a growth spurt, after a kundalini shift it often feels as if nothing in your life fits you anymore. Almost overnight, your home décor may feel outdated, your wardrobe shabby, your friends disconnected, and your career stagnated. It’s not unusual for even food and color preferences to dramatically change. You may have been perfectly content with your life before, and now suddenly, everything feels old, or even constraining.\nWhat has happened is that your base of perception, your awareness ‘set-point’, has shifted. A part of the old you is now gone, and you are still forming the new you. You really have two choices at this point: Try to stuff yourself back into your old life, or embrace the change. Which you choose will largely determine how you experience the rest of the stages in your shift.\nIf you try to go backwards, you will probably have a much more difficult time during Stages 3 and 4. If you embrace the changes you feel you need to make, set realistic goals for how to bring them about, and approach these goals with wisdom, clarity, and compassion, at the end of your shift, you will most likely have a beautiful new life – one that more closely reflects who you now are.\nOf course this doesn’t mean making rash decisions, which can be a tendency at this stage. While sometimes we truly are called to transform our entire life overnight and embark on a new direction, more often we are better served by slower, more considered, steps towards change.\nPart of the frustration we experience after major shifts stems from the difference between the material and spiritual rates of change. On the spiritual level, we might be filled with inspiration and ideas for what we want to manifest, but the material world usually moves at a slower pace, and we need to go through the proper steps and sequence. In the physical world, a flower is subject to the laws of nature.\nStage 3 – Emotion Motion\nAt some point after a shift, it’s common to feel as if you’ve gotten on an emotional roller coaster. You may experience mood swings and feel especially sensitive to the emotions of others. Women are especially prone to both, because our kundalini ‘home base’ is in our second, or sacral, chakra rather than our first chakra, and the second chakra is linked to our emotional body. Our subtle body also tends to be more sensitive to others’ emotions, so altogether women are more likely to experience both strong emotions, and strong swings.\nThere are two main shifts occurring at this point. First, as the kundalini moves through your energy body, it often unleashes new intuitive and energetic abilities. You may suddenly be able to ‘see’ things you weren’t able to before, and become much more aware of energetic subtleties in people and your environment. As you develop these, they can become true psychic and healing skills, but initially, the increased sensitivity may feel overwhelming. Taking some extra time to yourself, and focusing on self-care, will see you through this adjustment.\nContributing to emotional swings is any resistance you may feel to the growth you are undergoing. Old fears, insecurities, and attachments may rise up within you. You might feel frustrated if you’ve dealt with these emotions before, thinking you have gone backward on your path. But often, these are the final residue of old emotional patterns that have been hiding out in the deep recesses of your being. Your kundalini ‘flood’ has stirred them up, and brought them to the surface for you to completely face and resolve. Spend some time journaling, engaging in self-inquiry, or working with a counselor to work through this stage.\nStage 4 – School of Life\nThis stage is really the heart of the kundalini shifting process: What lessons do you need to learn? After a shift, your life resettles into a new pattern, and typically new themes – or old themes in a new guise! – show up in your life for you to begin to work on. This might mean new goals or opposition to reaching goals, new relationships or relationship challenges, or new situations that call upon a part of your being that you haven’t had to access before.\nIf a lot of emotional residue was kicked up during your shift (see Stage 3), then you can be sure that any challenges you face as part of your lessons will be sure to trigger them even more. This isn’t always the case though, and the more you go through this process, the less you are interested in resisting, and the gentler and happier your lessons can be. Growth doesn’t have to hurt, and in fact, there’s no reason for it to. Most often, it’s our own resistance that causes us pain.\nIt’s important to remind yourself at this point that you asked for this. It’s your own desire to grow, your own spiritual longing, that triggered the entire process in the first place. Enjoy your push to the sun! Center yourself in compassion, wisdom, and your connection to the divine, and you will always see yourself through. You are being an offered an opportunity to grow and shift into a new level of happiness and liberation.\nStage 5 – Integration\nWe don’t usually notice this stage, because it’s not marked by change. If we look back though, we can often see the evolution we have undergone. We are now comfortable in our new skin, our new perspective, and our new energy level. We have released our old emotional residue, and come to a new level of peace and understanding. We have grown up, on some fundamental level.\nIn a way though, for seekers kundalini shifts never complete, because while we are finishing up the cycle of one, we are probably already deep in the throes of another. We do have quiet periods, or lulls in the activity, when we are resting and regrouping. Or we might choose to slow down for a while, which is always an option. But ultimately, as the much tweeted saying goes, ‘we are spiritual beings having a human experience’, and so our spiritual desire eventually comes to the fore once again, triggering a new cycle. Enjoy the ride!\nThe meditation below is mostly meant to help with stages 3 and 4 as described in this article, but you can do it at any time. As I mentioned last month, the meditations offered in this series are not a form of kundalini activation or transmission, nor are they practices within a formal kundalini tradition. Instead, they are gentle energy work exercises designed to help you connect and activate your own kundalini (last month), and clear, smooth, and integrate shifts (this month.)"
  }]
}
